--[[
  ░█████╗░██████╗░███████╗░█████╗░████████╗██╗██╗░░░██╗██╗████████╗██╗░░░██╗
  ██╔══██╗██╔══██╗██╔════╝██╔══██╗╚══██╔══╝██║██║░░░██║██║╚══██╔══╝╚██╗░██╔╝
  ██║░░╚═╝██████╔╝█████╗░░███████║░░░██║░░░██║╚██╗░██╔╝██║░░░██║░░░░╚████╔╝░
  ██║░░██╗██╔══██╗██╔══╝░░██╔══██║░░░██║░░░██║░╚████╔╝░██║░░░██║░░░░░╚██╔╝░░
  ╚█████╔╝██║░░██║███████╗██║░░██║░░░██║░░░██║░░╚██╔╝░░██║░░░██║░░░░░░██║░░░
  ░╚════╝░╚═╝░░╚═╝╚══════╝╚═╝░░╚═╝░░░╚═╝░░░╚═╝░░░╚═╝░░░╚═╝░░░╚═╝░░░░░░╚═╝░░░                                                           


███╗░░░███╗░█████╗░██╗░░██╗░█████╗░███╗░░░███╗███████╗██████╗░  ░██████╗░█████╗░██╗░░░░░███████╗███╗░░░███╗
████╗░████║██╔══██╗██║░░██║██╔══██╗████╗░████║██╔════╝██╔══██╗  ██╔════╝██╔══██╗██║░░░░░██╔════╝████╗░████║
██╔████╔██║██║░░██║███████║███████║██╔████╔██║█████╗░░██║░░██║  ╚█████╗░███████║██║░░░░░█████╗░░██╔████╔██║
██║╚██╔╝██║██║░░██║██╔══██║██╔══██║██║╚██╔╝██║██╔══╝░░██║░░██║  ░╚═══██╗██╔══██║██║░░░░░██╔══╝░░██║╚██╔╝██║
██║░╚═╝░██║╚█████╔╝██║░░██║██║░░██║██║░╚═╝░██║███████╗██████╔╝  ██████╔╝██║░░██║███████╗███████╗██║░╚═╝░██║
╚═╝░░░░░╚═╝░╚════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░░░░╚═╝╚══════╝╚═════╝░  ╚═════╝░╚═╝░░╚═╝╚══════╝╚══════╝╚═╝░░░░░╚═╝
]]--

CMam = {} 
--[# طريقة التركيب؟ ]
--[# و عدل الكونفق و مبروك server.cfgاكتب هذا الكلام في الـ ]
--[# ensure CM_AdminManager ]
--[# اهم الاعدادات ]
CMam.Settings = {
  License = "", --[# رخصتك الي تجي مع الملف ]
  Server = "", --[# أسم سيرفرك ]
  Img = "", --[# شعار السيرفر ]
  Notify = function (player , msg) --[# النوتيفاي - في حال عندك نوتايفاي خاص يمديك تغيره ]
  TriggerClientEvent("pNotify:SendNotification",player,{
    text = "<span style='color:white;text-align: center;font-weight: 900'><h1><img src="..CMam.Settings.Img.." width='90' height='90'><br/><h2> "..msg.."  </span>",
    type = "info",
    timeout = (10*1000),
    layout = "centerleft",
  })
  end,
  Chats = function (user_id,PlayerName,Playerid,Reason) --[# الشات - في حال تبي تغير الكلام من هنا ]
    TriggerClientEvent("chatMessage", -1,"["..CMam.Settings.Server.."] ^6 Admin: [ "..user_id.." ] has jailed [ "..PlayerName.." ID : "..Playerid.."  ] ")
    TriggerClientEvent("chatMessage",-1,"["..CMam.Settings.Server.."] ^2Reason:^0"..Reason )
  end,
  Control = {
    AdminControl = { 
    MainMenu = "!-لوحة الادارة-!", --[# اسم القائمة الأساسية ]
    AdminsPermission = "", --[# برمشن جميع الأدمنية ]
    ChoicePermission = "", --[# برمشن قائمة الأدمنية ]
    AdminsMenu = { --[# قائمة الأدمنية ]
      MenuName = "!-ادارة الادمنية-!", --[# أسم القائمة الرئيسية ]
      Permission = "", --[# برمشن قائمة الأدمنية ]
      --[# الويب هوك                                          -                  البرميشن          -  أسم القائمة في الحوال  | الخاصية                                                                    ]
      Spectet = {name = "مراقبة الادمنية", Permission = "" ,Webhook = "" },
      Dragmenu = {name = "سحب و كلبشه", Permission = "" ,Webhook = "" },
      SendMsgMenu = {name = "رسالة للاداريين", Permission = "" ,Webhook = ""  },
      Onlinememu = {name = "الاداريين المتصلين", Permission = "" ,Webhook = ""  }, 
      msgTOAll = {name = "رسالة للجميع", Permission = "" ,Webhook = "" },
      Pullmenu = {name = "سحب جميع الادمنية",Permission = "" ,Webhook = ""},
      Addskins = {name = "اعطاء سكن",Permission = "" , Webhook = "" },
      --[# الويب هوك               -       كود السكن       -           البرميشن          -  أسم القائمة في الحوال  | الخاصية                                                                    ]
      SpawnCar = {name = "اعطاء مركبة",Permission = "" ,VehiclCode = "panto", Webhook = "" },
      Weapons = {  --[# الأسلحة ]
      name = "اخذ اسلحة الادراه",  --[# أسم القائمة في الجوال ]
      Permission = "", --[# البرميشن ]
      Webhook = "", --[# الويب هوك ]
      WeaponsList = { --[# الاسلحة الي تجي لللاعب ]
      --[#    عدد الرقصاص الي يجي مع اسلاح   -    كود السلاح    ]
        ["WEAPON_COMBATPISTOL"] = {250},
        ["WEAPON_PUMPSHOTGUN"] = {250},
        ["WEAPON_NIGHTSTICK"] = {250},
        ["WEAPON_STUNGUN"] = {250},
        ["WEAPON_CARBINERIFLE"] = {250},
        ["WEAPON_ADVANCEDRIFLE"] = {250},
        ["WEAPON_SMG"] = {250},
        ["WEAPON_SMOKEGRENADE"] = {250},
        ["WEAPON_BZGAS"] = {250},
        ["WEAPON_FLASHLIGHT"] = {250}
       }
      },
      Groupsmenu = { --[# قائمة التوظيف ]
      name = "• اداره التوظيف •", --[# أسم القائمة في الجوال ]
      --[# الويب هوك                                          -                  البرميشن          -  أسم القائمة في الحوال  | الخاصية                                                                    ]
      addGroup = {name = "1 - أضافة رتبة", Permission = "" ,Webhook = "" },
      removeGroup = {name = "2 - حذف رتبة", Permission = "",Webhook = "" },
      CheckGroup = {name = "3 - أستعلام عن رتب", Permission = "" ,Webhook = "" , DontCheck = "admins.login" },
      GroupsList = { 
      --[#   كود الرتبة   -    أسم الرتبة الي يبين في القائمة    ]
        ["1 - عاطل"] = "عاطل", 
        ["2 - ادمن"] = "جندي",
        ["3 - سبورت"] = "ملازم", 
        ["4 - تريل"] = "فريق",
        ["5 - هيلبر"] = "لواء",
       }
      }
      },
      CallAdmin = { --[# طلب الأدمن ]
      --[# الويب هوك                                          -                  البرميشن          -  أسم القائمة في الحوال  | الخاصية                                                                    ]
        calladmin = {name = "|| طلب ادمن ||", Permission = "",Webhook = "" },
        calladminGroup = {name = "|| طلب ادمن رتب ||", Permission = "",Webhook = "" },
        --[# الويب هوك                                               -  الأمر الي بل شات  | الكوماند                                                                ]
        Command = {com = "back" ,Webhook = "" }, -- كوماند الرجوع بعد طلب الادمن
        MxDesc = 30, --[# اعلى حد حروف في طلب الادمن ]
        client = {
          influence = true, --[# تشغيل/أيقاف تأثير قبول طلب الادمن ]
        }
      },
      Jailmenu = { --[# قائمة السجن ]
        name = "• ادارة السجن •", --[# أسم القائمة في الجوال ]
        Permission = "", --[# برمشن القائمة ]
        --[# الويب هوك                                          -                  البرميشن          -  أسم القائمة في الحوال  | الخاصية                                                   ]
        Jail = {name = "1 - سجن", Permission = "",Webhook = "" },
        UnJail = {name = "2 - فك السجن", Permission = "",Webhook = "" },
        OffLineJail = {name = "3 - سجن اوفلاين", Permission = "",Webhook = "" },
        Jailin = { x = 369.46649169922, y = -1020.1157226563, z = 57.529262542725 },  --[# أحداثيات دخول السجن ]
        Jailout = { x = 164.69277954102, y = -993.96655273438, z = 29.484910964966 }, --[# أحداثيات الخروج من السجن ]
      },
      Ticket = { --[# قائمة التكتات ]
        name = "• ادارة التكتات •", --[# أسم القائمة في الجوال ]
        Permission = "", --[# برميشن القائمة ]
        --[# الويب هوك                                          -                  البرميشن          -  أسم القائمة في الحوال  | الخاصية                                                                    ]
        GetAdminTickets = {name = "1 - استعلام عن تيكتات اداري", Permission = "",Webhook = "" },
        DelteeAdminTickets = {name = "2 - تصفير تيكتات اداري", Permission = "",Webhook = "" },
        DeleteAllTickets = {name = "3 - تصفير جميع التيكتات", Permission = "",Webhook = "" },
        StopTickets = { --[# تشغيل/أيقاف الطلبات الأدمن ]
          Permission = "", --[# برميشن القائمة ]
          start = "4 - تشغيل الطلبات الأدمن", --[# أسم خيار التشغيل في القائمة ]
          stop  = "4 - ايقاف الطلبات الأدمن", --[# أسم خيار الايقاف في القائمة ]
          Webhook = "" --[# الويب هوك ]
        },
        stopreception = { --[# تشغيل/أيقاف أستقبال الطلبات الأدمن ]
          Permission = "", --[# برميشن القائمة ]
          start = "5 - تشغيل أستقبال الطلبات", --[# أسم خيار التشغيل في القائمة ]
          stop  = "5 - ايقاف أستقبال الطلبات", --[# أسم خيار الايقاف في القائمة ]
          Webhook = "" --[# الويب هوك ]
        },
      },
      Notes = { --[# قائمة الملاحظات ]
        name = "• ادارة الملاحظات •", --[# أسم القائمة في الجوال ]
        Permission = "", --[# برميشن القائمة ]
        --[# الويب هوك                                          -                  البرميشن          -  أسم القائمة في الحوال  | الخاصية                                                  ]
        Note = {name = "1 - تدوين ملاحظة", Permission = "",Webhook = "" },
        CheckNote = {name = "2 - استعلام عن ملاحظات لاعب", Permission = "",Webhook = "" },
        RemoveNote = {name = "3 - حذف ملاحظات", Permission = "",Webhook = "" },
      },
      Chatmenu = { --[# قائمة الشات ]
      name = "• ادارة الشات •", --[# أسم القائمة في الجوال ]
      Permission = "", --[# برمشن القائمة ]
      stopchat = { --[# أيقاف الشات ]
        Permission = "", --[# برمشن القائمة ]
        start = "1 - تشغيل الشات", --[# أسم خيار تشغيل الشات في القائمة ]
        stop  = "2 - ايقاف الشات", --[# أسم خيار أيقاف ]
        Webhook = "" --[# الويب هوك ]
      },
      Clearchat = { --[# أعطاء ميوت شات ]
      Permission = "", --[# برمشن القائمة ]
      Clear = "3 - حذف الشات", --[# أسم خيار الحذف في القائمة ]
      Webhook = "" --[# الويب هوك ]
      },
      Mutechat = { --[# أعطاء ميوت شات ]
        Permission = "", --[# برمشن القائمة ]
        Mute = "4 - اعطاء ميوت", --[# أسم خيار الميوت في القائمة ]
        UnMute  = "5 - فك ميوت", --[# أسم خيار فك الميوت في القائمة ]
        Webhook = "" --[# الويب هوك ]
      },
      },
      DeleteMenu = {
      name = "• قائمه الحذف •", --[# أسم القائمة في الجوال ]
      Permission = "", --[# برمشن القائمة ]
      --[# الويب هوك                                          -                  البرميشن          -  أسم القائمة في الحوال  | الخاصية                                                                    ]
      DeleteAllCars = {name = "1 - حذف جميع المركبات", Permission = "",Webhook = "" },
      DeleteAllPeds = {name = "2 - حذف جميع البوتات", Permission = "",Webhook = "" },
      DeleteAllObject = {name = "3 - حذف جميع الاوبجكتات", Permission = "",Webhook = "" },
      ClearWeapons = {name = "4 - حذف اسلحة اللاعبين", Permission = "",Webhook = "" },
      RemovePlayerWeapons ={name = "5 - حذف اسلحة لاعب", Permission = "",Webhook = "" },
      },
      TPRequest = { --[# قوائم الريكويست ]
        name = "• قائمه الأنتقالات •", --[# أسم القائمة في الجوال ]
        Permission = "", --[# برمشن القائمة ]
        TPto = "طلب انتقال", --[# أسم القائمة في الجوال - طلب الانتفال ]
        TPmy = "طلب سحب", --[# أسم القائمة في الجوال - طلب السحب ]
        Webhook = "" --[# الويب هوك ]
      },
      UnCuffed = { --[# أختصار كلبشة/ فك الكلبشة ]
        Command = "ss", --[# الكوماند الي ينكتب في الشات ]
        Permission = "", --[# برمشن الأختصار ]
        Webhook = ""  --[# الويب هوك ]
      },
      AdminConnect = { --[# دخول الادمن لسيرفر ]
        joined = "", --[# ويب هوك الدخول ]
        left = "" --[# ويب هوك الخروج ]
      },
      Attendance = { --[# قائمة التحضير ]
        login = "",  --[# ويب هوك الدخول ]
        Logout = "", --[# ويب هوك الخروج ]
        Groups = {
          --[#        أسم الرتبة في اللوق  |       كود السكن       |       أسم الرتبة الفيك        |        كود الرتبة  ]
          {Group = "" , Groupfake = "" , Skinlogin = "", NameLog = ""},
        },
      }
      },
      Spams = { --[# السبام ]
        TicketsSpam = 25, --[# مانع سبام طلبات الادمن ]
        RequestSpam = 10, --[# مانع سبام قبول طلبات الادمن للادمنية ]
        RequestSpam = 5, --[# مانع سبام ل طلب الانتقال ]
        Login = 8 --[# مانع سبام ل تسجيل دخول وخروج الاداره ]
      },
    }
}

--[[
  ░█████╗░██████╗░███████╗░█████╗░████████╗██╗██╗░░░██╗██╗████████╗██╗░░░██╗
  ██╔══██╗██╔══██╗██╔════╝██╔══██╗╚══██╔══╝██║██║░░░██║██║╚══██╔══╝╚██╗░██╔╝
  ██║░░╚═╝██████╔╝█████╗░░███████║░░░██║░░░██║╚██╗░██╔╝██║░░░██║░░░░╚████╔╝░
  ██║░░██╗██╔══██╗██╔══╝░░██╔══██║░░░██║░░░██║░╚████╔╝░██║░░░██║░░░░░╚██╔╝░░
  ╚█████╔╝██║░░██║███████╗██║░░██║░░░██║░░░██║░░╚██╔╝░░██║░░░██║░░░░░░██║░░░
  ░╚════╝░╚═╝░░╚═╝╚══════╝╚═╝░░╚═╝░░░╚═╝░░░╚═╝░░░╚═╝░░░╚═╝░░░╚═╝░░░░░░╚═╝░░░                                                           


███╗░░░███╗░█████╗░██╗░░██╗░█████╗░███╗░░░███╗███████╗██████╗░  ░██████╗░█████╗░██╗░░░░░███████╗███╗░░░███╗
████╗░████║██╔══██╗██║░░██║██╔══██╗████╗░████║██╔════╝██╔══██╗  ██╔════╝██╔══██╗██║░░░░░██╔════╝████╗░████║
██╔████╔██║██║░░██║███████║███████║██╔████╔██║█████╗░░██║░░██║  ╚█████╗░███████║██║░░░░░█████╗░░██╔████╔██║
██║╚██╔╝██║██║░░██║██╔══██║██╔══██║██║╚██╔╝██║██╔══╝░░██║░░██║  ░╚═══██╗██╔══██║██║░░░░░██╔══╝░░██║╚██╔╝██║
██║░╚═╝░██║╚█████╔╝██║░░██║██║░░██║██║░╚═╝░██║███████╗██████╔╝  ██████╔╝██║░░██║███████╗███████╗██║░╚═╝░██║
╚═╝░░░░░╚═╝░╚════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░░░░╚═╝╚══════╝╚═════╝░  ╚═════╝░╚═╝░░╚═╝╚══════╝╚══════╝╚═╝░░░░░╚═╝
]]--